# IsServiceAvailable Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ShapeImporter..::..IsServiceAvailable Method
ShapeImporter Class See Also
---
Checks whether the data conversion service is available.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static bool IsServiceAvailable()
```

Visual Basic
---
```text
Public Shared Function IsServiceAvailable As Boolean
```

Visual C++
---
```text
public:
static bool IsServiceAvailable()
```

# ### Return Value
True if the data conversion service is available, false otherwise.
# Remarks
ShapeImporter relies on optional data conversion functionality. This function checks whether it is available.
# See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace